sdaiPrevious(Sdai_ItrId*)
\details
Moves the current position of a specified iterator to the previous aggregate item.
\param iterator [in] An iterator.
\returns sdaiTRUE if there is a member at the new position; otherwise, the function returns sdaiFALSE.